{% extends "homepage/base.html" %}
{% load static %}
{% block content %}
		<section id="hero_in" class="general">
			<div class="wrapper">
				<div class="container">
					<h1 class="fadeInUp"><span></span>Trực Quan Giúp Người Học Nâng Tầm Tri Thức</h1>
				</div>
			</div>
		</section>


		<div class="bg_color_1">
			<div class="container margin_120_95">
				<div class="main_title_2">
					<span><em></em></span>
					<h2 style="text-align:center">Giới Thiệu</h2>
					<p style="text-align:center">Những Điều Cần Biết Về Hệ Thống Dạy Học Lập Trình Trực Quan VS-Pro</p>
				</div>
				<div class="row justify-content-between">
					<div class="box_cart" style="padding-left:5%; padding-right:5%">
						
						<p style="text-align:center"><strong><em><img alt="" src="/media/2018/12/14/apple-touch-icon-144x144-precomposed.png" style="height:144px; width:144px" /></em></strong></p>
						<p style="text-align:justify">Trong cuộc sống hiện nay, lĩnh vực C&ocirc;ng nghệ th&ocirc;ng tin v&agrave; Truyền th&ocirc;ng ng&agrave;y c&agrave;ng ph&aacute;t triển v&agrave; đ&atilde; từng bước khẳng định được vị thế của m&igrave;nh đối với sự ph&aacute;t triển của to&agrave;n nh&acirc;n loại. Ứng với thời đại c&ocirc;ng nghiệp mới, k&eacute;o theo n&oacute; l&agrave; y&ecirc;u cầu một sự đổi mới to&agrave;n diện cả về cơ sở hạ tầng v&agrave; kiến tr&uacute;c thượng tầng. Để đ&aacute;p ứng điều đ&oacute;, nền gi&aacute;o dục cũng phải c&oacute; những sự thay đổi mang t&iacute;nh c&aacute;ch mạng. Ở bộ m&ocirc;n Tin học n&oacute;i ri&ecirc;ng, Phương ph&aacute;p dạy học lập tr&igrave;nh theo hướng Trực quan h&oacute;a đang được xem l&agrave; lựa chọn h&agrave;ng đầu v&agrave; thu h&uacute;t được nhiều nh&agrave; gi&aacute;o dục tham gia nghi&ecirc;n cứu v&agrave; t&igrave;m hiểu. Đ&oacute; cũng ch&iacute;nh l&agrave; nền tảng cho sự ra đời của <strong><em>VS-PRO LEARNING SYSTEM.</em></strong></p>
						<p style="text-align:justify"><strong><em>VS-Pro</em></strong><strong> </strong>l&agrave; một hệ thống dạy &ndash; học tập trực tuyến, được l&ecirc;n &yacute; tưởng v&agrave; ph&aacute;t triển bởi nh&oacute;m 6 sinh vi&ecirc;n ng&agrave;nh Sư phạm Tin học kh&oacute;a 41 thuộc khoa C&ocirc;ng Nghệ Th&ocirc;ng Tin trường đại học Sư phạm TP.HCM.</p>
						<p style="text-align:justify"><strong><em>VS- Pro </em></strong>ra đời nhằm tạo ra một m&ocirc;i trường dạy học v&agrave; học tập l&yacute; tưởng cho m&ocirc;n học lập tr&igrave;nh. Với m&ocirc;i trường trực quan sinh động v&agrave; hệ thống hỗ trợ người d&ugrave;ng ti&ecirc;n tiến, <strong><em>VS &ndash; Pro</em> </strong>lu&ocirc;n đ&aacute;p ứng gần như to&agrave;n vẹn nhu cầu của người dạy lẫn người học trong c&ocirc;ng t&aacute;c x&acirc;y dựng v&agrave; thực thi nội dung b&agrave;i dạy.</p>
						<p style="text-align:justify"><strong><em>VS- Pro </em></strong>l&agrave; hệ thống học tập trực tuyến, được thiết kế chuy&ecirc;n biệt h&oacute;a cho những kh&oacute;a học về lập tr&igrave;nh theo hướng trực quan. Hiện tại hệ thống <strong><em>VS-Pro </em></strong>tổng quan bao gồm 3 kh&oacute;a học lập tr&igrave;nh trực quan tương ứng với 3 m&ocirc;i trường cụ thể được Chuyên gia giảng vi&ecirc;n thiết kế ph&ugrave; hợp với từng độ tuổi, cấp học. Chi tiết như sau:</p>
						<li style="text-align:justify; padding-left:10%"><strong>Tynker – Thế giới trong mơ:</strong> Khóa học dạy học lập trình với Tynker được thiết kế phù hợp với trẻ Tiểu Học, ứng với độ tuổi từ 7 đến 12 tuổi.</li>	
						<li style="text-align:justify; padding-left:10%"><strong>Alice 3D – Say mê sáng tạo:</strong> Khóa học dạy học lập trình với Alice3D được thiết kế phù hợp với học sinh cấp THCS , ứng với độ tuổi từ 13 đến 15 tuổi.</li>	
						<li style="text-align:justify; padding-left:10%"><strong>Arduino – Conbo Kỳ diệu:</strong> Khóa học dạy học lập trình với Arduino được thiết kế phù hợp với học sinh cấp THPT , ứng với độ tuổi từ 16 đến 18 tuổi.</li>	
						<br>
						<p style="text-align:justify">VS-Pro ra đời dựa tr&ecirc;n niềm hy vọng v&agrave; mong muốn tạo ra một m&ocirc;i trường học tập mới lạ về h&igrave;nh thức v&agrave; l&yacute; tưởng về nội dung. Th&ocirc;ng qua hệ thống n&agrave;y, ch&uacute;ng t&ocirc;i mong muốn c&oacute; thể đ&oacute;ng g&oacute;p một phần v&agrave;o c&ocirc;ng cuộc thay đổi tư duy lập tr&igrave;nh của học sinh n&oacute;i ri&ecirc;ng v&agrave; bộ m&ocirc;n tin học trong thời đại mới n&oacute;i chung; G&oacute;p phần nhỏ trong việc tạo ra những con người mới với những tư duy t&iacute;ch cực v&agrave; năng động. ch&acirc;n th&agrave;nh cảm ơn c&aacute;c bạn!</p>

						<p style="text-align: justify" ><em><strong>Nhóm Sinh Viên ĐHSP</strong></em></p>
					</div>
				</div>
				<!--/row-->
			</div>







			
			<!--/container-->
		</div>
		<!--/bg_color_1-->
		
		<!--/hero_in-->

		<div class="container margin_120_95">
			<div class="main_title_2">
				<span><em></em></span>
				<h2 >Visual Programing Learning System <br>VS-PRO</h2>
				<p>Tại Sao Bạn Nên Học Trên Hệ Thống VS-PRO?</p>
			</div>
			<div class="row">
				<div class="col-lg-4 col-md-6">
					<a class="box_feat" style = "pointer-events: none" >
						<i class="pe-7s-diamond"></i>
						<h3>Những Khóa Học Chất Lượng</h3>
						<p>Các khóa Học chất lượng được biên soạn dựa trên kịch bản chi tiết, đã qua thẳm định và khẳng định chất lượng. Được cập nhật thường xuyên và hệ thống rõ ràng.</p>
					</a>
				</div>
				<div class="col-lg-4 col-md-6">
					<a class="box_feat" style = "pointer-events: none">
						<i class="pe-7s-display2"></i>
						<h3>Nội Dung Độc Đáo</h3>
						<p>Nội dung giảng dạy được chọn lọc, tinh chỉnh thích hợp với từng đối tượng, có sự kết hợp nhuần nhuyễn đa dạng phương pháp tiếp cận kiến thức khác nhau.</p>
					</a>
				</div>
				<div class="col-lg-4 col-md-6">
					<a class="box_feat" style = "pointer-events: none" >
						<i class="pe-7s-science"></i>
						<h3>Giáo dục công nghệ 4.0</h3>
						<p>Giáo dục theo hướng STEM đã trở thành kim chỉ nam thể hiện thông qua Phương pháp dạy học lặp trình theo lối trực quan hóa, lấy người học làm trung tâm.</p>
					</a>
				</div>
				<div class="col-lg-4 col-md-6">
					<a class="box_feat" style = "pointer-events: none" >
						<i class="pe-7s-rocket"></i>
						<h3>Kịch Bản Chi Tiết</h3>
						<p>Nội dung dạy học rõ ràng, chi tiết ,được Chuyên gia GV chọn lọc và biên soạn bài bản thành từng module kịch bản cô động, hàm súc.</p>
					</a>
				</div>
				<div class="col-lg-4 col-md-6" >
					<a class="box_feat" style = "pointer-events: none">
						<i class="pe-7s-target" ></i>
						<h3>Tập Trung Vào Mục Tiêu</h3>
						<p>Chúng tôi mong muốn tạo ra môi trường học tập bộ môn lặp trình theo hướng trực quan hóa, thay đổi tư duy lặp trình cho người học theo từng nhóm đối tượng.</p>
					</a>
				</div>
				<div class="col-lg-4 col-md-6">
					<a class="box_feat" style = "pointer-events: none">
						<i class="pe-7s-graph1"></i>
						<h3>Hướng Tới Thành Công</h3>
						<p>VS-Pro cung cấp một môi trường lý tưởng cho việc tương tác, học tập và trao đổi kinh nghiệm, giúp người học nâng cao khả năng lập trình và đạt được mục tiêu.</p>
					</a>
				</div>
			</div>
			<!--/row-->
		</div>
		<!-- /container -->

		



		</div>

		<div class="bg_color_1">
			<div class="container margin_120_95">
				<div class="main_title_2">
					<span><em></em></span>
					<h2>Dạy Học Lập Trình Trực Quan</h2>
					<p>Một Số Khái Niệm Chung Về Phương Pháp Dạy Học Lập Trình Trực Quan</p>
				</div>
				<div class="row justify-content-between">
					<div class="col-lg-6 wow" data-wow-offset="150">
						<figure class="block-reveal">
							<div class="block-horizzontal"></div>
							<img src="https://img.icons8.com/color/1600/visual-studio.png" class="img-fluid" alt="" style="width: 800px; height:330px">
						</figure>
					</div>
					<div class="col-lg-5">
						<p style="margin-bottom:10px; text-align: justify"><strong>Lập trình</strong> là khái niệm dùng để chỉ một chuỗi các hành động được thiết đặc, sắp xếp theo một trình tự nhất quán thông qua những thao tác xử lý để tạo ra kết quả.</p>
						<p style="margin-bottom:10px; text-align: justify"><strong>Trực quan</strong> được hiểu như là kiểu quan sát một cách trực diện những gì sẽ xảy ra hoặc đang xẩy ra.Trên phương diện lập trình, trực quan là khả năng lập trình một cách trực diện, cụ thể và có thể dễ dàng kiểm soát, nhìn thấy kết quả và hành động chính xác một cách trực tiếp.</p>
						<p style="margin-bottom:10px; text-align: justify"><strong>Lập trình trình trực quan</strong> là hình thức lập trình có sử dụng các form và control để đại diện cho một vùng hoặc một chức năng cụ thể, đôi khi có thể liên kết hoặc tương tác với nhau. Tạo nên sự đơn giản hóa về hình thức cũng như phương thức, giao tác thực thi.</p>
					</div>
				</div>
				<!--/row-->
			</div>


			<div class="container margin_120_95">
				<div class="main_title_2">
					<span><em></em></span>
					<h2>Định Hướng Giáo Dục STEM</h2>
					<p>Giới Thiệu Tổng Quan Về Định Hướng Giáo Dục STEM</p>
				</div>
				<div class="row justify-content-between">
					<div class="col-lg-5">
						<p style="margin-bottom:10px; text-align:justify"><strong>Kh&aacute;i niệm</strong>: STEM l&agrave; một m&ocirc; h&igrave;nh học tập gắn kết c&aacute;c ứng dụng thực tế dựa tr&ecirc;n &yacute; tưởng trang bị cho người học những kiến thức, kĩ năng li&ecirc;n quan đến&nbsp;<strong>Khoa học</strong>, <strong>C&ocirc;ng Nghệ</strong>, <strong>Kỹ Thuật</strong> &nbsp;v&agrave; <strong>To&aacute;n Học</strong> &ndash; theo c&aacute;ch <strong>tiếp cận li&ecirc;n m&ocirc;n&nbsp;</strong>v&agrave; người học c&oacute; thể &aacute;p dụng để giải quyết vấn đề trong cuộc sống h&agrave;ng ng&agrave;y thay v&igrave; dạy bốn m&ocirc;n học như c&aacute;c đối tượng t&aacute;ch biệt v&agrave; rời rạc.</p>
						<p style="margin-bottom:10px; text-align:justify"><span ><span><strong><span>Học tập v&agrave; ứng dụng :</span></strong><span "> Gi&aacute;o dục định hướng STEM c&oacute; thể &aacute;p dụng trải rộng tr&ecirc;n nhiều đối tượng từ trẻ nhỏ đến học sinh THPT, nhưng ứng với từng nh&oacute;m đối tượng sẽ c&oacute; những cấp độ kh&aacute;c nhau:</span></span></span></p>
						<p style="margin-bottom:10px; text-align:justify"><em><strong>Ở Tiểu Học:</strong></em>&nbsp;tạo cảm hứng, gi&uacute;p trẻ l&agrave;m quen, kh&aacute;m ph&aacute; cuộc sống xung quanh.&nbsp;<em><strong>Ở THCS:</strong></em>&nbsp;tạo điều kiện cho c&aacute;c em dễ tiếp cận c&aacute;c kiến thức mới.&nbsp;<span ><em><strong>Ở THPT:</strong></em> tạo được sự li&ecirc;n hệ giữa c&aacute;c lĩnh vực STEM một c&aacute;ch r&otilde; r&agrave;ng, gi&uacute;p học sinh giải quyết những vấn đề th&aacute;ch thức hơn,&nbsp;hỗ trợ h&igrave;nh th&agrave;nh r&otilde; r&agrave;ng lộ tr&igrave;nh nghề nghiệp.</span></p>
					</div>
					<div class="col-lg-6 wow" data-wow-offset="150">
						<figure class="block-reveal">
							<div class="block-horizzontal"></div>
							<img src="http://khoahocysinh.edu.vn/wp-content/uploads/2018/11/STEM-logo2.png" class="img-fluid" alt="" style="width: 800px; height:380px">
						</figure>
					</div>
					
				</div>
				<!--/row-->
			</div>




			<div class="container margin_120_95">
				<div class="main_title_2">
					<span><em></em></span>
					<h2>Ứng Dụng Thực Tế Phương Pháp</h2>
					<p>Thế Mạnh Và Ứng Dụng Của Phương Pháp Giáo Dục STEM</p>
				</div>
				<div class="row justify-content-between">
					<div class="col-lg-6 wow" data-wow-offset="150">
						<figure class="block-reveal">
							<div class="block-horizzontal"></div>
							<img src="https://thpt-ngogiatu-daklak.edu.vn/wp-content/uploads/2018/08/stem-logo.png" class="img-fluid" alt="" style="width: 800px; height:350px">
						</figure>
					</div>
					<div class="col-lg-5">
						<p style="margin-bottom:2px; font-size:11pt; text-align:justify"><span ><span ><strong><span >Điểm mạnh của STEM - Phương ph&aacute;p dạy học trực quan:</span></strong></span></span>
							<li style="padding-left:10px; text-align: justify;"><span ><span ><span >Ngữ cảnh v&agrave; t&igrave;nh hướng học tập cụ thể</span></span></span></li>
							<li style="padding-left:10px; text-align: justify;"><span ><span ><span >Khơi dạy niềm đam m&ecirc; học tập từ sớm</span></span></span></li>
							<li style="padding-left:10px; text-align: justify;"><span ><span ><span >M&ocirc;i trường học tập vui nhộn</span></span></span></li>
							<li style="padding-left:10px; text-align: justify;"><span ><span ><span >&nbsp;Rất quan trọng trong kỉ nguy&ecirc;n mới &ndash; kỷ nguy&ecirc;n số h&oacute;a</span></span></span></li>
							<li style="padding-left:10px; text-align: justify;"><span ><span ><span >Gi&uacute;p người học ph&aacute;t triển c&aacute;c kỹ năng quan s&aacute;t, l&ecirc;n kế hoạch, thực h&agrave;nh, kỹ năng ph&acirc;n t&iacute;ch , tổng hợp, v&agrave; giao tiếp</span></span></span></li>
						<p style=" margin-bottom:10px"></p>
						<p style=" margin-bottom:3px; font-size:11pt; text-align:justify"><span ><span ><strong><span >STEM đang c&oacute; mặt ở đ&acirc;u ? </span></strong></span></span></p>
						<p style=" margin-top:3px; margin-bottom:3px; text-align:justify"><em><strong><span ><span ><span >Hoa kỳ :&nbsp;</span></span></span></strong></em><span ><span ><span >Li&ecirc;n minh STEM - STEM Education Coalition Hoa Kỳ,&nbsp;</span></span></span><span ><span ><span >C&aacute;c chương tr&igrave;nh của Bộ Quốc ph&ograve;ng Hoa Kỳ,&nbsp;<span ><span ><span >Nasa.</span></span></span></span></span></span>
						<span ><span ><span ><em><strong>; &Uacute;c:</strong></em> Hệ Thống iSTEM; </span></span></span>
						<span ><span ><span ><em><strong>Canada: </strong></em>Học bổng Schulich Leader; </span></span></span>
						<span ><span ><span ><em><strong>Thổ Nhĩ Kỳ: </strong></em>Nh&oacute;m c&ocirc;ng t&aacute;c gi&aacute;o dục STEM của Thổ Nhĩ Kỳ; </span></span></span>
						<span ><span ><span ><em><strong>Việt Nam: </strong></em>Ở Việt Nam, bắt đầu từ năm 2012, nhiều tổ chức gi&aacute;o dục tư thục c&oacute; c&aacute;c s&aacute;ng kiến ​​gi&aacute;o dục STEM.</span></span></span>&nbsp;<span style="font-size:11.0pt"><span >V&agrave;o năm học 2015 - 2016, Bộ Gi&aacute;o dục v&agrave; Đ&agrave;o tạo đ&atilde; khuyến kh&iacute;ch nội dung STEM trong chương tr&igrave;nh gi&aacute;o dục đ&agrave;o tạo.</span></span></p>
						</p>
					</div>
				</div>
				<!--/row-->
			</div>
			<!--/container-->



			<div class="container margin_120_95">
			<div class="main_title_2">
				<span><em></em></span>
				<h2>PHẢN HỒI NGƯỜI DÙNG</h2>
				<p>Những Cảm Nhận Của Người Dùng Sau Khi Trải Nghiệm Hệ Thống</p>
			</div>
			<div id="carousel" class="owl-carousel owl-theme"  >
				<div class="item"  >
					<a>
						<div class="title" >
							<h4 >Lê Thị Bích Thuận<em>Gv Tin học trường TH- THCS – THPT Trí Đức , Kênh 19/5 quận Tân Phú, TP. HCM</em><br><p  style="text-align: justify; font-size:10pt"><span>"Tôi thật sự rất hài lòng với module học tập : “ Tynker – Thế Giới Trong Mơ” bởi vì sự trực quan hóa và đơn giản mà module học tập này mang lại. vừa đơn giản , dễ sử dụng lại thêm phần ngộ nghĩnh vui tươi, Các em học sinh tôi phụ trách thật sự thích thú module học tập này, điều đó gián tiếp tạo nên sự yêu thích giờ học tin học trong các em ! Tôi xin chân thành cảm ơn."</span></p></h4>	
						</div>
						<img src="http://via.placeholder.com/500x700/ccc/fff/1_carousel.jpg" alt="">
					</a>
				</div>
				<div class="item">
					<a>
						<div class="title" >
							<h4 >Võ Minh Thông<em>Gv Tin học trường THPT Thường Tân – B.Tân Uyên – Bình Dương</em><br><p  style="text-align: justify; font-size:10pt"><span>"Module “ Arduino – Combo Kỳ Diệu” là một môi trường học tập tuyệt vời mà tôi và học sinh trường tôi đang cần. Hệ thống bài giảng tương tác trực quan và rất sinh động. Bên cạnh đó hệ thống trò chơi rất hấp dẫn và phù hợp với mục tiêu củng cố kiến thức bài học. Nội dung đánh giá cuối khóa học thật sáng tạo và phát huy được mục đích kiểm tra đánh giá học sinh đồng thời hoạt động này cũng góp phần giúp học sinh của tôi tự tin hơn vào bản thân mình."</span></p></h4>	
						</div>
						<img src="http://via.placeholder.com/500x700/ccc/fff/1_carousel.jpg" alt="">
					</a>
				</div>
				<div class="item">
					<a>
						<div class="title" >
							<h4 >Võ Ngọc Phương Uyên<em>GV Tin học trường THCS Cù Chính Lan – Hai Bà Trưng – Hà Nội</em><br><p  style="text-align: justify; font-size:10pt"><span>" “Alice 3D – Say mê sáng tạo”  - là một trong những module học tập mà tôi và học trò của mình thích thú nhất. Với nội dung hấp dẫn và hoạt động dạy học đơn giản nhưng tinh tế module này đã trở thành nơi mà học sinh mà tôi phụ trách lui tới vào những giờ học tin học thực hành. Vừa học được tư duy lập trình, vừa tạo ra sản phẩm đồ học 2D – 3D vui mắt thì còn gì bằng ! Bên cạnh đó, mọi thứ sẽ tuyệt vời hơn nếu các bạn có thể bổ sung thêm tính năng tương tác online giữa giáo viên và học sinh – điều này sẽ thật sự cần thiết. xin chân thành cảm ơn."</span></p></h4>	
						</div>
						<img src="http://via.placeholder.com/500x700/ccc/fff/1_carousel.jpg" alt="">
					</a>
				</div>
				<div class="item">
					<a >
						<div class="title" >
							<h4 >Phạm Văn Cẩn<em>HS trường THPT TRần Duy Hưng - TPHCM</em><br><p  style="text-align: justify; font-size:10pt"><span>"Em nghĩ hệ thống Tin tức cần cập nhật thông tin nhanh chóng và đa dạng hơn nữa. Mọi trải nghiệm trực quan đều rất tốt ! Cảm ơn Chuyên gia VS-Pro"</span></p></h4>	
						</div>
						<img src="http://via.placeholder.com/500x700/ccc/fff/1_carousel.jpg" alt="">
					</a>
				</div>
				<div class="item">
					<a >
						<div class="title" >
							<h4 >Đỗ Ngọc Thiện Nguyện<em>HS trường THPT Chuyên Long An - Tân An - Long An</em><br><p  style="text-align: justify; font-size:10pt"><span>"Phần “ Chia sẻ dự án” của Module Arduino – Combo Kỳ Diệu thật là tuyệt vời! Ở đây em đã tìm được thật nhiều ý tưởng cho dự án học tập của mình! Cảm ơn VS-Pro đã cung cấp một môi trường học tập thật thú vị!"</span></p></h4>	
						</div>
						<img src="http://via.placeholder.com/500x700/ccc/fff/1_carousel.jpg" alt="">
					</a>
				</div>
				<div class="item">
					<a >
						<div class="title" >
							<h4 >Đỗ Trường Xuân<em>HS trường THPT Nguyễn Thông - Châu Thành - Long An</em><br><p  style="text-align: justify; font-size:10pt"><span>"6.	Trò Chơi và Cuộc Thi là hai phần thú vị nhất của VS-Pro đối với em, Ở đây, chúng em có thể giải trí bằng những trò chơi hấp dẫn và thử sức bản thân mình thông qua các kỳ thi, đồng thời tham khảo dự án của mọi người để rút kinh nghiệm cho bản thân mình. Bên cạnh đó, phần “ Hỏi – đáp” cũng thật sự hữu ích đối với những học viên mới như em! Chân thành cảm ơn VS-Pro đã cung cấp một hệ thống học tập rất hay và hấp dẫn."</span></p></h4>	
						</div>
						<img src="http://via.placeholder.com/500x700/ccc/fff/1_carousel.jpg" alt="">
					</a>
				</div>
			</div>
			<!-- /carousel -->


		</div>
		<!--/bg_color_1-->

		
		<!--/container-->

		
	{% endblock%}
	<!--/main-->
	